VibeEngineering-LLC/radex-esp32/firmware-idf/main/ble_radex.c
// ==========================================================================
//  ble_radex.c - BLE-клиент к радон-детектору Radex MR107ion.
//
//  ПРОИСХОЖДЕНИЕ: перенесён из диагностического полигона
//  firmware/radex-idf/main/radex_main.c, где был доказан замером:
//  705 успешных чтений / 0 разрывов за 900 с (2026-08-27, лог
//  logs/hci/s3_autodisc_off_v2_20260827.log). Логика чтения не менялась -
//  изменён только способ выдачи значений: вместо печати в лог вызывается
//  колбэк, заданный ble_radex_start().
//
//  КЛЮЧЕВОЕ (#RADEX-4 H44). Bluedroid по умолчанию сам запускает service
//  discovery на каждом соединении (auto_disc=TRUE, bta_gattc_act.c). У
//  MR107ion он никогда не завершается, и наши ATT-чтения встают в очередь
//  позади него - прибор трое суток выглядел "не отвечающим". Отключается
//  недокументированным BTA_GATTC_AutoDiscoverEnable(0), причём ТОЛЬКО из
//  обработчика ESP_GATTC_REG_EVT: вызов из app_main затирается поздним
//  сбросом флага внутри bta_gattc_enable().
// ==========================================================================
#include "ble_radex.h"
#include <stdio.h>
#include <string.h>
#include <esp_bt.h>
#include <esp_idf_version.h>   /* #RADEX-86: cancel_open появился только в IDF 6.x */
#include <esp_bt_main.h>
#include <esp_gap_ble_api.h>
#include <esp_gattc_api.h>
#include <esp_gatt_common_api.h>
#include <esp_gatts_api.h>
#include <esp_log.h>
#include <esp_system.h>   /* #RADEX-145: esp_reset_reason/esp_restart */
#include <nvs_flash.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/semphr.h>

extern uint8_t BTA_GATTC_AutoDiscoverEnable(uint8_t enable);

#define TAG "radex"

#define RADEX_PRE_READ_MS      4000
#define RADEX_MTU_FALLBACK_MS  5000
#define RADEX_LOCAL_PRIVACY    1

// Адрес прибора НЕ зашивается в прошивку: у каждого пользователя он свой, а
// публиковать реальный MAC нельзя. Порядок: NVS -> если пусто, ищем в эфире
// по имени (MR107*/Radex*) и предъявляем найденное в Web UI.
#define RADEX_NVS_NS    "radex"
#define RADEX_NVS_MAC   "mac"
#define RADEX_NVS_ATYPE "atype"

static esp_bd_addr_t s_target_addr;
static uint8_t       s_target_atype = BLE_ADDR_TYPE_RANDOM;
static bool          s_have_target  = false;


#define H_RADON_LAST  0x0049
#define H_RADON_AVG   0x0040
#define H_TEMP_X10    0x0058
#define H_HUMIDITY    0x005E
/* #RADEX-18: прибор сам считает СКО своего среднего и время измерения.
   Наше среднее строится по выборке раз в 10 минут, приборное — по всем его
   замерам, поэтому приборное точнее, а СКО даёт статистическую неопределённость
   в процентах (пункт 10.1 ТЗ). Время измерения нужно, чтобы понять, за какой
   период это среднее посчитано: от включения прибора, а не от начала теста. */
#define H_SKO_AVG     0x0043
#define H_T_IZM       0x0046

/* #RADEX-18: за сессию прибор успевает отдать РОВНО ЧЕТЫРЕ значения — замер
   28.08: чтения идут по 2-5 с, на пятом прибор рвёт связь (status=133/259,
   reason=8 через ~20 с после подключения). Поэтому круг всегда из четырёх:
   два первых — радон (он нужен каждый раз и идёт в оценку), два оставшихся
   берутся по очереди из остальных величин. Температура, влажность, СКО и
   время измерения меняются медленно, обновления раз в 20-40 минут им хватает. */
#define POLL_FIXED  2       /* radon_last + radon_avg — всегда */
#define POLL_ROT    2       /* сколько ротируемых берём за круг */

static const uint16_t s_fixed[POLL_FIXED] = { H_RADON_LAST, H_RADON_AVG };
static const uint16_t s_rot[] = { H_TEMP_X10, H_HUMIDITY, H_SKO_AVG, H_T_IZM };
static const int s_rot_n = 4;
static int s_rot_pos = 0;               /* сдвигается на POLL_ROT каждый круг */

static uint16_t s_handles[POLL_FIXED + POLL_ROT];
static const int s_handle_count = POLL_FIXED + POLL_ROT;

/* Собрать круг: фиксированные + следующая пара ротируемых. */
static void poll_build(void)
{
    for (int i = 0; i < POLL_FIXED; i++) s_handles[i] = s_fixed[i];
    for (int i = 0; i < POLL_ROT; i++)
        s_handles[POLL_FIXED + i] = s_rot[(s_rot_pos + i) % s_rot_n];
    s_rot_pos = (s_rot_pos + POLL_ROT) % s_rot_n;
}

esp_gatt_if_t s_gattc_if;
uint16_t s_conn_id;
uint8_t s_handle_cursor;
SemaphoreHandle_t s_reconnect_sem;
static volatile int s_connected = 0;
volatile TickType_t s_open_tick;
volatile int s_mtu_state = 0;
static volatile uint32_t s_read_ok, s_read_err, s_disconnects;

/* #RADEX-84. Разрыв установленного соединения и неудачная попытка его открыть —
   разные события, и мерить их одним счётчиком нельзя. Счётчик «разрывов связи» за
   38 минут показал 50 694 — оператор резонно прочитал это как связь, рвущуюся
   двадцать раз в секунду. Связи не было ни секунды: это 50 694 неудачных попытки
   её открыть.
   Уточнение после стерильного разбора: приходящий в этом случае reason=0x100 —
   это ESP_GATT_CONN_CONN_CANCEL, то есть решение ХОСТА снять свою попытку. Он не
   является ответом контроллера и ничего не говорит о том, есть ли прибор в эфире;
   прежняя формулировка здесь приписывала коду смысл, которого у него нет. */
static volatile uint32_t s_open_fails;

/* #RADEX-145: после реального разрыва (rsn=0x8) контроллер иногда вешает
   КАЖДУЮ следующую попытку `open` на `Cmd Disallowed` (opcode 0x2043)
   навсегда — залипание внутри контроллера, `cancel_open` (RADEX-86) его
   не видит («No such connection need to be cancelled» = хост свободен).
   Единственное штатное лекарство без физического power-cycle — переинит
   BT через `esp_restart()`: подтверждено на живой плате (см. журнал
   #RADEX-145). Порог — счётчик подряд неудачных `open` с последнего
   успеха, см. ниже. */
#define RADEX_AUTO_RESTART_AFTER_FAILS  8
static volatile uint32_t s_consec_open_fails;

/* Пауза перед повторной попыткой, растущая вдвое до потолка. Без неё задача
   переподключения крутится со скоростью ответа контроллера (~25 попыток в
   секунду): эфир засоряется и лог тонет — ради этого пауза и введена.
   ВАЖНО, что пауза НЕ лечит: «Cmd Disallowed» приходит одинаково и через 1 с, и
   через 30 с (лог diag-trace-20260829). Прежнее объяснение «предыдущая попытка
   не завершена, когда шлётся следующая» этим же логом опровергнуто. */
#define RADEX_RECONNECT_MIN_MS   1000
#define RADEX_RECONNECT_MAX_MS  30000
static volatile uint32_t s_reconnect_delay_ms = RADEX_RECONNECT_MIN_MS;

// #RADEX-7 (2026-08-28, оператор: «не надо так часто парсить прибор»).
// Опрос шёл по кругу без пауз: каждый ответ немедленно тянул следующее
// чтение — 196 чтений за 5 минут. Радону такая частота не нужна: прибор
// меряет раз в 60 с, а значение меняется часами (замер 28.08: 113 чтений
// подряд дали 6 разных значений). Держим связь, но между кругами молчим.
#define RADEX_POLL_PERIOD_MS  600000   // 10 минут между кругами опроса
static volatile TickType_t s_next_poll_tick;   // когда начать следующий круг
static volatile int s_poll_active;             // круг идёт прямо сейчас

// #RADEX-153b (31.08): строка «статус: …» печаталась безусловно раз в 10 с и
// вытесняла из кольцевого лога (24 КБ, ~250 строк) реальные события. Замер до
// правки на живой плате: в выдаче /api/log 76 строк из 82 — одна и та же
// НЕизменившаяся строка, видимое окно журнала всего 12,5 мин. Разрывы, отказы
// чтения, неудачные open и перезапуски #RADEX-145 уезжали из кольца за минуты,
// и к моменту, когда человек открывает лог, их там уже не было.
// Печатаем по ИЗМЕНЕНИЮ четвёрки (чтения/ошибки/разрывы/связь) плюс редкий
// heartbeat — чтобы молчание не путали с зависшей платой. Сами счётчики и
// watchdog #RADEX-145 не затронуты: меняется только условие печати.
#define RADEX_STATUS_CHECK_TICKS   100   // проверять состояние раз в 10 с
#define RADEX_STATUS_HEARTBEAT_N    60   // 60 × 10 с = heartbeat раз в 10 мин

static ble_radex_cb_t s_cb = NULL;

// Значение получено. Печать оставлена (её видно в кольцевом логе Web UI),
// но основная выдача - колбэк потребителю.
static void radex_on_measurement(uint16_t handle, float value)
{
    switch (handle) {
        case 0x0049: ESP_LOGI(TAG, "радон (последний) = %.2f Бк/м3", value); break;
        case 0x0040: ESP_LOGI(TAG, "радон (среднее прибора) = %.2f Бк/м3", value); break;
        case 0x0058: ESP_LOGI(TAG, "температура = %.1f C", value); break;
        case 0x005E: ESP_LOGI(TAG, "влажность = %.0f %%", value); break;
        default:     ESP_LOGI(TAG, "handle 0x%04X = %.3f", handle, value); break;
    }
    if (s_cb) s_cb(handle, value);
}

static int radex_decode(uint16_t handle, const uint8_t *data, uint16_t len, float *out)
{
    if (len < 1) return 0;

