VibeEngineering-LLC/radex-esp32/firmware-idf/main/ble_radex.c
    switch (handle) {
        case H_RADON_LAST:
        case H_RADON_AVG:
            if (len < 4) return 0;
            memcpy(out, data, 4);
            return 1;
        case H_TEMP_X10:
            if (len < 2) return 0;
            int16_t temp;
            memcpy(&temp, data, 2);
            *out = (float)temp / 10.0f;
            return 1;
        case H_HUMIDITY:
            *out = (float)data[0];
            return 1;
        case H_SKO_AVG:
            if (len < 4) return 0;
            memcpy(out, data, 4);          /* float32 LE, Бк/м3 */
            return 1;
        case H_T_IZM: {
            if (len < 4) return 0;
            uint32_t secs;
            memcpy(&secs, data, 4);        /* uint32 LE, секунды */
            *out = (float)secs;
            return 1;
        }
        default:
            return 0;
    }
}

static void issue_read(void)
{
    esp_err_t ret = esp_ble_gattc_read_char(s_gattc_if, s_conn_id, s_handles[s_handle_cursor], ESP_GATT_AUTH_REQ_NONE);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "чтение handle 0x%04X отказано, status=%d", s_handles[s_handle_cursor], ret);
    }
}

static void start_polling(const char *why)
{
    s_mtu_state = 1;
    s_handle_cursor = 0;
    s_poll_active = 1;
    poll_build();      /* каждый круг — своя пара ротируемых величин */
    ESP_LOGI(TAG, "старт опроса (%s)", why);
    issue_read();
}


// ── Поиск прибора в эфире ─────────────────────────────────────────────────
// Прибор рекламируется именем вида "MR107ion NNNN". Ищем по префиксу имени:
// сервис FE651700 в рекламе не всегда присутствует, а имя есть всегда.
#define SCAN_MAX 8
typedef struct {
    esp_bd_addr_t addr;
    uint8_t       atype;
    int8_t        rssi;
    char          name[24];
} radex_found_t;

static radex_found_t s_found[SCAN_MAX];
static uint8_t       s_found_n = 0;
static bool          s_scanning = false;

static bool name_looks_like_radex(const char *n, int len)
{
    if (len <= 0) return false;
    return (len >= 6 && strncasecmp(n, "MR107", 5) == 0) ||
           (len >= 5 && strncasecmp(n, "Radex", 5) == 0);
}

static void target_save(const esp_bd_addr_t addr, uint8_t atype)
{
    nvs_handle_t h;
    if (nvs_open(RADEX_NVS_NS, NVS_READWRITE, &h) != ESP_OK) return;
    nvs_set_blob(h, RADEX_NVS_MAC, addr, sizeof(esp_bd_addr_t));
    nvs_set_u8(h, RADEX_NVS_ATYPE, atype);
    nvs_commit(h);
    nvs_close(h);
}

static bool target_load(void)
{
    nvs_handle_t h;
    if (nvs_open(RADEX_NVS_NS, NVS_READONLY, &h) != ESP_OK) return false;
    size_t len = sizeof(esp_bd_addr_t);
    bool ok = (nvs_get_blob(h, RADEX_NVS_MAC, s_target_addr, &len) == ESP_OK &&
               len == sizeof(esp_bd_addr_t));
    if (ok) {
        uint8_t a = BLE_ADDR_TYPE_RANDOM;
        nvs_get_u8(h, RADEX_NVS_ATYPE, &a);
        s_target_atype = a;
    }
    nvs_close(h);
    return ok;
}

static void scan_start(void)
{
    static esp_ble_scan_params_t sp = {
        .scan_type          = BLE_SCAN_TYPE_ACTIVE,   // нужен SCAN_RSP: имя приходит в нём
        .own_addr_type      = BLE_ADDR_TYPE_RANDOM,
        .scan_filter_policy = BLE_SCAN_FILTER_ALLOW_ALL,
        .scan_interval      = 0x50,
        .scan_window        = 0x30,
        .scan_duplicate     = BLE_SCAN_DUPLICATE_DISABLE,
    };
    s_found_n = 0;
    s_scanning = true;
    esp_ble_gap_set_scan_params(&sp);   // старт скана — в SCAN_PARAM_SET_COMPLETE
    ESP_LOGI(TAG, "прибор не задан — ищу в эфире");
}

// ── Публичный API поиска (для Web UI) ─────────────────────────────────────
bool ble_radex_has_target(void) { return s_have_target; }
bool ble_radex_scanning(void)   { return s_scanning; }

int ble_radex_found_json(char *buf, size_t len)
{
    int n = snprintf(buf, len, "{\"scanning\":%s,\"has_target\":%s,\"found\":[",
                     s_scanning ? "true" : "false", s_have_target ? "true" : "false");
    for (uint8_t i = 0; i < s_found_n && n > 0 && n < (int)len; i++) {
        n += snprintf(buf + n, len - n,
            "%s{\"mac\":\"%02X:%02X:%02X:%02X:%02X:%02X\",\"name\":\"%s\",\"rssi\":%d}",
            i ? "," : "",
            s_found[i].addr[0], s_found[i].addr[1], s_found[i].addr[2],
            s_found[i].addr[3], s_found[i].addr[4], s_found[i].addr[5],
            s_found[i].name, s_found[i].rssi);
    }
    if (n > 0 && n < (int)len) n += snprintf(buf + n, len - n, "]}");
    return n;
}

// Принимает MAC вида AA:BB:CC:DD:EE:FF. Сохраняет и перезагружает плату:
// стек уже поднят под другую цель, чистый рестарт надёжнее донастройки.
bool ble_radex_set_target(const char *mac_str)
{
    unsigned v[6];
    if (sscanf(mac_str, "%x:%x:%x:%x:%x:%x", &v[0],&v[1],&v[2],&v[3],&v[4],&v[5]) != 6)
        return false;
    esp_bd_addr_t a;
    uint8_t atype = BLE_ADDR_TYPE_RANDOM;
    for (int i = 0; i < 6; i++) {
        if (v[i] > 0xFF) return false;
        a[i] = (uint8_t) v[i];
    }
    // Если адрес есть среди найденных — берём его тип адреса, он достовернее.
    for (uint8_t i = 0; i < s_found_n; i++)
        if (memcmp(s_found[i].addr, a, sizeof(a)) == 0) atype = s_found[i].atype;
    target_save(a, atype);
    ESP_LOGW(TAG, "прибор задан: %02X:%02X:%02X:%02X:%02X:%02X — перезагрузка",
             a[0],a[1],a[2],a[3],a[4],a[5]);
    return true;
}

static void gap_event_handler(esp_gap_ble_cb_event_t event, esp_ble_gap_cb_param_t *param)
{
    switch (event) {
        case ESP_GAP_BLE_SCAN_PARAM_SET_COMPLETE_EVT:
            if (s_scanning) esp_ble_gap_start_scanning(0);   // 0 = до остановки
            break;
        case ESP_GAP_BLE_SCAN_RESULT_EVT: {
            struct ble_scan_result_evt_param *r = &param->scan_rst;
            if (r->search_evt != ESP_GAP_SEARCH_INQ_RES_EVT) break;
            uint8_t nlen = 0;
            uint8_t *nm = esp_ble_resolve_adv_data(r->ble_adv,
                              ESP_BLE_AD_TYPE_NAME_CMPL, &nlen);
            if (!nm || !name_looks_like_radex((const char *)nm, nlen)) break;
            for (uint8_t i = 0; i < s_found_n; i++)
                if (memcmp(s_found[i].addr, r->bda, sizeof(esp_bd_addr_t)) == 0) {
                    s_found[i].rssi = r->rssi;
                    goto scan_done;
                }
            if (s_found_n < SCAN_MAX) {
                radex_found_t *f = &s_found[s_found_n++];
                memcpy(f->addr, r->bda, sizeof(esp_bd_addr_t));
                f->atype = r->ble_addr_type;
                f->rssi  = r->rssi;
                uint8_t c = nlen < sizeof(f->name) - 1 ? nlen : sizeof(f->name) - 1;
                memcpy(f->name, nm, c);
                f->name[c] = 0;
                ESP_LOGI(TAG, "найден прибор: %s, %02X:%02X:%02X:%02X:%02X:%02X, RSSI %d",
                         f->name, f->addr[0],f->addr[1],f->addr[2],
                         f->addr[3],f->addr[4],f->addr[5], f->rssi);
            }
scan_done:
            break;
        }
        case ESP_GAP_BLE_SEC_REQ_EVT:
            esp_ble_gap_security_rsp(param->ble_security.ble_req.bd_addr, true);
            break;
        case ESP_GAP_BLE_SET_LOCAL_PRIVACY_COMPLETE_EVT:
            ESP_LOGI(TAG, "локальная приватность установлена, status=%d", param->local_privacy_cmpl.status);
            esp_ble_gattc_app_register(0);
            break;
        case ESP_GAP_BLE_UPDATE_CONN_PARAMS_EVT:
            // Прибор шлёт свой запрос параметров и не обслуживает ATT, пока
            // согласование не закончилось. В доказанной серии первое чтение
            // уходило именно отсюда, а не по таймеру.
            if (s_connected && param->update_conn_params.status == 0 &&
                s_mtu_state != 1 && s_mtu_state != 2) {
                start_polling("параметры соединения согласованы");
            }
            break;
        default:
            break;
    }
}

static void gatts_event_handler(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *param)
{
    (void)gatts_if;
    if (event == ESP_GATTS_MTU_EVT) {
        ESP_LOGI(TAG, "прибор согласовал MTU=%d", param->mtu.mtu);
        if (s_mtu_state == 0) {
            s_mtu_state = 3;
        }
    }
}

