VibeEngineering-LLC/radex-esp32/firmware-idf/main/ble_radex.c
static void gattc_event_handler(esp_gattc_cb_event_t event, esp_gatt_if_t gattc_if, esp_ble_gattc_cb_param_t *param)
{
    switch (event) {
        case ESP_GATTC_REG_EVT: {
            s_gattc_if = gattc_if;
            uint8_t prev = BTA_GATTC_AutoDiscoverEnable(0);
            ESP_LOGW(TAG, "авто-discovery Bluedroid ВЫКЛЮЧЕН (было %d)", (int)prev);
            if (s_have_target) {
                esp_ble_gattc_open(gattc_if, s_target_addr, s_target_atype, true);
            } else {
                scan_start();      // прибор ещё не выбран — ищем и ждём выбора в Web UI
            }
            break;
        }
        case ESP_GATTC_OPEN_EVT:
            if (param->open.status != ESP_GATT_OK) {
                /* #RADEX-84: та же строка на каждую попытку заполняла лог целиком.
                   Счётчик неудач ведётся отдельно, здесь достаточно первых
                   нескольких и далее каждой двадцатой. */
                if (s_open_fails <= 3 || (s_open_fails % 20) == 0) {
                    ESP_LOGE(TAG, "ошибка открытия соединения (неудач подряд: %lu)",
                             (unsigned long) s_open_fails);
                }
                break;
            }
            s_conn_id = param->open.conn_id;
            s_connected = 1;
            s_consec_open_fails = 0;   /* #RADEX-145: связь встала — счётчик залипания с нуля */
            s_reconnect_delay_ms = RADEX_RECONNECT_MIN_MS;   /* #RADEX-84: связь есть — пауза с нуля */
            s_open_tick = xTaskGetTickCount();
            s_handle_cursor = 0;
            ESP_LOGI(TAG, "соединение установлено, conn_id=%d", s_conn_id);
            esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_CONN_HDL0, ESP_PWR_LVL_P20);
            break;
        case ESP_GATTC_READ_CHAR_EVT:
            if (param->read.conn_id != s_conn_id) break;
            if (param->read.status == ESP_GATT_OK) {
                s_read_ok++;
                float value;
                // Атрибуция строго по handle ИЗ ОТВЕТА, не по курсору: курсор —
                // наше намерение, а не то, на что прибор реально ответил.
                if (radex_decode(param->read.handle, param->read.value, param->read.value_len, &value)) {
                    radex_on_measurement(param->read.handle, value);
                } else {
                    ESP_LOGW(TAG, "handle 0x%04X: не разобран (len=%d)", param->read.handle, param->read.value_len);
                }
            } else {
                s_read_err++;
                ESP_LOGW(TAG, "чтение handle 0x%04X отказано, status=%d", param->read.handle, param->read.status);
            }
            s_handle_cursor = (s_handle_cursor + 1) % s_handle_count;
            // #RADEX-7: круг закончен (курсор вернулся к началу) — молчим до
            // следующего срока. Раньше здесь безусловно шло issue_read(), и
            // опрос крутился непрерывно.
            if (s_handle_cursor == 0) {
                s_poll_active = 0;
                s_next_poll_tick = xTaskGetTickCount() + pdMS_TO_TICKS(RADEX_POLL_PERIOD_MS);
                ESP_LOGI(TAG, "круг опроса завершён (принято %lu, ошибок %lu) — "
                              "следующий через %d мин",
                         (unsigned long) s_read_ok, (unsigned long) s_read_err,
                         RADEX_POLL_PERIOD_MS / 60000);
            } else {
                issue_read();
            }
            break;
        case ESP_GATTC_CFG_MTU_EVT:
            ESP_LOGI(TAG, "обмен MTU завершён (mtu=%d)", param->cfg_mtu.mtu);
            if (s_mtu_state == 0) {
                s_mtu_state = 3;
            }
            break;
        case ESP_GATTC_DISCONNECT_EVT:
            /* #RADEX-84: разрывом считается только потеря УСТАНОВЛЕННОГО соединения.
               То же событие приходит на каждую неудачную попытку открытия, когда
               прибора нет в эфире, — это отдельный счётчик. */
            int was_connected = s_connected;
            if (was_connected) s_disconnects++; else s_open_fails++;
            if (!was_connected) s_consec_open_fails++;   /* #RADEX-145 */
            s_connected = 0;
            s_mtu_state = 0;
            // #RADEX-7, исправление: круг мог оборваться посреди чтений (прибор
            // отвалился на втором из четырёх). Тогда курсор не возвращался к
            // нулю, флаг «опрос идёт» оставался поднятым — и следующий плановый
            // опрос не запускался НИКОГДА: условие в главном цикле требует
            // !s_poll_active. Плата молча переставала опрашивать прибор, внешне
            // выглядя исправной. Поймано на живой плате 28.08: 1 чтение из 4,
            // дальше тишина. Снимаем флаг на любом разрыве.
            s_poll_active = 0;
            s_handle_cursor = 0;
            TickType_t duration = (xTaskGetTickCount() - s_open_tick) * portTICK_PERIOD_MS;
            if (was_connected) {
                ESP_LOGW(TAG, "разрыв соединения, reason=%d, длительность=%lu мс, разрывы=%lu",
                         param->disconnect.reason, duration, s_disconnects);
            } else {
                /* Не разрыв, а неудачная попытка: печатаем реже, иначе лог платы
                   состоит из одной этой строки и полезное в нём не найти. */
                if (s_open_fails <= 3 || (s_open_fails % 20) == 0) {
                    ESP_LOGW(TAG, "прибор не отвечает на открытие соединения, reason=%d, неудачных попыток=%lu",
                             param->disconnect.reason, s_open_fails);
                }
            }
            /* #RADEX-145: N подряд неудачных open — контроллер, вероятно, залип
               (Cmd Disallowed навсегда). Проверено на живой плате: esp_restart()
               снимает залипание, backoff сам по себе — нет. */
            if (s_consec_open_fails >= RADEX_AUTO_RESTART_AFTER_FAILS) {
                ESP_LOGE(TAG, "%lu подряд неудачных open — перезапуск (подозрение на залипание контроллера)",
                         (unsigned long) s_consec_open_fails);
                esp_restart();
            }
            xSemaphoreGive(s_reconnect_sem);
            break;
        default:
            break;
    }
}

static void reconnect_task(void *arg)
{
    (void)arg;
    while (1) {
        xSemaphoreTake(s_reconnect_sem, portMAX_DELAY);
        /* #RADEX-84: пауза ОБЯЗАТЕЛЬНА до следующей попытки. Без неё контроллер
           получает новую команду открытия раньше, чем закрыл предыдущую, и
           отвечает «Cmd Disallowed» (HCI opcode 0x2043) — попытки не просто
           бесполезны, они мешают друг другу. */
        uint32_t d = s_reconnect_delay_ms;
        vTaskDelay(pdMS_TO_TICKS(d));
        /* #RADEX-86. ПРИЧИНА НЕ УСТАНОВЛЕНА — не считать этот вызов исправлением.

           Достоверно из лога diag-trace-20260829: первая попытка падает на радио
           («hcif disc complete rsn 0x3e», CONN_FAILED_ESTABLISHMENT, через 4,8 с);
           внутри обработки этого события стек САМ шлёт ещё одну команду создания
           соединения (l2c_link.c, ветка retry при 0x3E), и она получает
           «Cmd Disallowed»; дальше КАЖДАЯ попытка отвергается за ~10 мс, уже без
           «disc complete», и так до перезагрузки.

           Чего лог НЕ доказывает: что состояние держит незакрытое создание
           соединения в контроллере. Bluedroid печатает command status только при
           ошибке, успешные команды невидимы, поэтому одинаково возможны:
             — незакрытый инициатор в контроллере;
             — смешение legacy (0x200D) и extended (0x2043) наборов команд, что по
               спецификации обязано давать 0x0C до самого сброса — и косвенно
               подтверждается тем, что варнинг is_aux есть у попыток 2+ и нет у первой;
             — застрявший LCB на стороне хоста.
           Чтобы различить, нужен полный HCI-трейс (CONFIG_BT_HCI_LOG_DEBUG_EN).

