VibeEngineering-LLC/radex-esp32/firmware-idf/main/ble_radex.c
           Про сам вызов: проверочный прогон шёл на ЗАВЕДОМО ОТСУТСТВУЮЩЕМ адресе,
           где 0x3E не приходит и ломаться нечему, — то есть менял две переменные
           разом и ничего не доказал. В логе видно «No such connection need to be
           cancelled»: отменять было нечего, вызов оказался пустым. Он стоит после
           паузы бэкоффа, когда попытка давно завершена; чтобы иметь смысл, его
           надо звать сразу по факту неудачи, а не перед следующей. Оставлен как
           безвредный, пока причина не установлена. */
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
        esp_ble_gattc_cancel_open_params_t cp = { .gattc_if = s_gattc_if };
        memcpy(cp.remote_bda, s_target_addr, sizeof(esp_bd_addr_t));
        esp_err_t cancel = esp_ble_gattc_cancel_open(&cp);
        if (cancel != ESP_OK) {
            ESP_LOGD(TAG, "отмена ожидающего открытия: %s", esp_err_to_name(cancel));
        }
        vTaskDelay(pdMS_TO_TICKS(200));   /* дать контроллеру закрыть своё состояние */
#endif
        ESP_LOGI(TAG, "переподключение (пауза была %lu мс)...", (unsigned long) d);
        s_open_tick = xTaskGetTickCount();
        esp_ble_gattc_open(s_gattc_if, s_target_addr, s_target_atype, true);
        d *= 2;
        s_reconnect_delay_ms = (d > RADEX_RECONNECT_MAX_MS) ? RADEX_RECONNECT_MAX_MS : d;
    }
}

static esp_err_t bt_stack_init(void)
{
    esp_err_t ret;

    ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        nvs_flash_erase();
        ret = nvs_flash_init();
    }
    if (ret != ESP_OK) return ret;

    esp_bt_controller_mem_release(ESP_BT_MODE_CLASSIC_BT);
    esp_bt_controller_config_t bt_cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
    ret = esp_bt_controller_init(&bt_cfg);
    if (ret != ESP_OK) return ret;

    ret = esp_bt_controller_enable(ESP_BT_MODE_BLE);
    if (ret != ESP_OK) return ret;

    ret = esp_bluedroid_init();
    if (ret != ESP_OK) return ret;

    ret = esp_bluedroid_enable();
    if (ret != ESP_OK) return ret;

    return ESP_OK;
}

static void security_params_init(void)
{
    esp_ble_auth_req_t auth_req = ESP_LE_AUTH_NO_BOND;
    esp_ble_io_cap_t iocap = ESP_IO_CAP_NONE;
    uint8_t key_size = 16;
    uint8_t init_key = ESP_BLE_ENC_KEY_MASK | ESP_BLE_ID_KEY_MASK;
    uint8_t rsp_key = ESP_BLE_ENC_KEY_MASK | ESP_BLE_ID_KEY_MASK;

    esp_ble_gap_set_security_param(ESP_BLE_SM_AUTHEN_REQ_MODE, &auth_req, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_IOCAP_MODE, &iocap, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_MAX_KEY_SIZE, &key_size, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_SET_INIT_KEY, &init_key, sizeof(uint8_t));
    esp_ble_gap_set_security_param(ESP_BLE_SM_SET_RSP_KEY, &rsp_key, sizeof(uint8_t));
}

static void tx_power_max(void)
{
    const esp_ble_power_type_t types[] = {ESP_BLE_PWR_TYPE_DEFAULT, ESP_BLE_PWR_TYPE_ADV, ESP_BLE_PWR_TYPE_SCAN};
    for (int i = 0; i < 3; ++i) {
        esp_ble_tx_power_set(types[i], ESP_PWR_LVL_P20);
    }
}

void ble_radex_start(ble_radex_cb_t cb)
{
    s_cb = cb;
    s_have_target = target_load();
    if (s_have_target) {
        ESP_LOGI(TAG, "прибор из NVS: %02X:%02X:%02X:%02X:%02X:%02X (тип адреса %d)",
                 s_target_addr[0], s_target_addr[1], s_target_addr[2],
                 s_target_addr[3], s_target_addr[4], s_target_addr[5], s_target_atype);
    }
    esp_err_t ret;

    ret = bt_stack_init();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "ошибка инициализации стека Bluetooth");
        return;
    }

    esp_ble_gap_register_callback(gap_event_handler);
    esp_ble_gattc_register_callback(gattc_event_handler);

    esp_ble_gatts_register_callback(gatts_event_handler);
    esp_ble_gatts_app_register(1);

    esp_ble_gatt_set_local_mtu(247);
    security_params_init();
    tx_power_max();

    s_reconnect_sem = xSemaphoreCreateBinary();
    if (s_reconnect_sem == NULL) {
        ESP_LOGE(TAG, "ошибка создания семафора");
        return;
    }

    xTaskCreate(reconnect_task, "radex_reconnect", 3072, NULL, 5, NULL);

    if (RADEX_LOCAL_PRIVACY) {
        ret = esp_ble_gap_config_local_privacy(true);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "настройка локальной приватности не удалась");
            esp_ble_gattc_app_register(0);
        }
    } else {
        esp_ble_gattc_app_register(0);
    }

    int tick = 0;
    /* #RADEX-153b: последняя НАПЕЧАТАННАЯ четвёрка. last_conn = -1 — признак
       «ещё ни разу не печатали»: первая же проверка тогда даёт строку с
       исходным состоянием, иначе после старта журнал молчал бы до первого
       события и выглядел бы как неработающий. */
    uint32_t last_ok = 0, last_err = 0, last_disc = 0;
    int      last_conn = -1;
    int      quiet_periods = 0;   // проверок подряд, прошедших без печати
    while (1) {
        vTaskDelay(pdMS_TO_TICKS(100));
        tick++;
        // Условия проверяются на КАЖДОМ тике 100 мс. Вкладывать их в счётчик
        // печати нельзя: пауза 4000 мс превратилась бы в 10 с и первый запрос
        // мог не успеть уйти до разрыва.
        TickType_t since_open = xTaskGetTickCount() - s_open_tick;
        if (s_connected && s_mtu_state == 3 && since_open >= pdMS_TO_TICKS(RADEX_PRE_READ_MS)) {
            start_polling("пауза после обмена MTU выдержана");
        } else if (s_connected && s_mtu_state == 0 && since_open > pdMS_TO_TICKS(RADEX_MTU_FALLBACK_MS)) {
            s_mtu_state = 2;
            ESP_LOGW(TAG, "прибор про MTU промолчал -> читаем без обмена");
            start_polling("таймаут MTU");
        }
        // #RADEX-7: очередной круг по расписанию. Условие проверяется на каждом
        // тике 100 мс — вкладывать его в счётчик печати нельзя (та же ловушка,
        // что описана выше про паузу MTU).
        if (s_connected && !s_poll_active && s_next_poll_tick != 0 &&
            (int32_t)(xTaskGetTickCount() - s_next_poll_tick) >= 0) {
            start_polling("плановый опрос");
        }
        // #RADEX-153b: проверяем по-прежнему раз в 10 с, но печатаем только при
        // изменении четвёрки либо по heartbeat. Маркер «(без изменений)»
        // отличает heartbeat от строки по событию.
        if (tick % RADEX_STATUS_CHECK_TICKS == 0) {
            uint32_t ok = s_read_ok, err = s_read_err, disc = s_disconnects;
            int  conn = s_connected ? 1 : 0;
            bool changed = (ok != last_ok) || (err != last_err) ||
                           (disc != last_disc) || (conn != last_conn);
            quiet_periods++;
            if (changed || quiet_periods >= RADEX_STATUS_HEARTBEAT_N) {
                ESP_LOGI(TAG, "статус: чтений=%lu ошибок=%lu разрывов=%lu связь=%s%s",
                         (unsigned long) ok, (unsigned long) err,
                         (unsigned long) disc, conn ? "есть" : "нет",
                         changed ? "" : " (без изменений)");
                last_ok = ok; last_err = err; last_disc = disc; last_conn = conn;
                quiet_periods = 0;
            }
        }
    }
}

// ── Диагностические геттеры (для /api/status) ─────────────────────────────
bool     ble_radex_connected(void)   { return s_connected != 0; }
uint32_t ble_radex_reads_ok(void)    { return s_read_ok; }
uint32_t ble_radex_read_errors(void) { return s_read_err; }
uint32_t ble_radex_disconnects(void) { return s_disconnects; }
uint32_t ble_radex_open_fails(void) { return s_open_fails; }
